# 1. с клавиатуры вводятся 2 целых числа a и b. Нужно вывести все числа в диапазоне от a до b, а так же указать количество этихчисел.

# a=int(input())
# b=int (input())
# q=0
# for a in range (a,b+1):
#     print (a)
#     q=q+1
# print ("количество чисел ", q)    

# 2. Сумма заданных чисел
# a=1
# b=3
# c=a+b
# print (c)


# 3. Строка наоборот
# def solution(string):
#     result_string = ''
#     for i in range (len(string)-1,-1,-1):
#         # print (string[i])
#         result_string += string[i]
#     return result_string    

# def solution(string):
#     return string[::-1]

# 4. Напишите программу, которая выводит на экран текст «I***like***Python» (без кавычек).
# print ("I", "like", "Python", sep="***")

#  5. Напишите программу, которая считывает строку-разделитель и три строки, а затем выводит указанные строки через разделитель.
# a=input( )
# b=input()
# c=input()
# d=input()
# print (b, c, d, sep=a)

# 6.Напишите программу, которая считывает три целых числа и выводит на экран их сумму. Каждое число записано в отдельной строке.
# a = int(input())
# a += int(input())
# a += int(input())
# print(a)

# 7. Есть список aa = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89].
# Выведите все элементы, которые меньше 5.

# aa = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
# for elem in aa:
#     if elem < 5:
#         print (elem)


